Revit 2026 API

# RebarReinforcementDataRebarId Property

---

The id of the Rebar

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId RebarId { get; set; }
```
```vb
Public Property RebarId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ RebarId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member RebarId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace